<!-- dflook/terraform-github-actions {"workspace":"variables-renderer","backend":"5149c6c1a838d5f0d96ba02ecd756fdf20bfda69f596d9c03b0826415db42609","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #285 at https://github.com/dflook/terraform-github-actions/actions/runs/3526569819","plan_hash":"7ef8ee19d40e2a0a485032b1604a26b71258a6e07181e81bffe431d5467d0126","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __variables-renderer__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`<details><summary>With variables</summary>

```hcl
length = 10

```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "YyZJQRipcg" -> (known after apply)
  ~ foreach = "v6x4tygwm1" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #285](https://github.com/dflook/terraform-github-actions/actions/runs/3526569819)